# Authenticated enumeration
* [Entra ID](#Entra-ID)
  * [Azure portal](#Azure-portal)
  * [Microsoft Graph](#Microsoft-Graph)
    * [MG module](#MG-module)
      * [Authentication](#Authentication)
      * [Users](#Users)
      * [Groups](#Groups)
      * [Roles](#Roles)
      * [Devices](#Devices)
      * [Administrative Unit](#Administrative-Unit)
      * [Applications](#Applications)
    * [Microsoft Graph API calls](#Microsoft-Graph-API)
  * [AzureAD Module](#AzureAD-Module)
    * [User enumeration](#User-enumeration)
    * [Group enumeration](#Group-enumeration)
    * [Role enumeration](#Role-enumeration)
    * [Devices enumeration](#Devices-enumeration)
    * [Administrative-unit Enumeration](#Administrative-unit-enumeration)
    * [App enumeration](#App-enumeration)
    * [Service-principals enumeration](#Service-principals-enumeration)
* [Azure Resources](#Azure-Resources)
  * [Enumeration using AZ PowerShell](#Enumeration-using-AZ-powershell)
    * [Available resources](#Available-resources)
    * [Roles](#Roles)
    * [Users](#Users)
    * [Groups](#Groups)
    * [Resources](#Resources)
  * [Enumeration using Azure CLI](#Enumeration-using-Azure-CLI)
  * [ARM API](#ARM-API)
* [Tools](#Tools)
  * [Roadtools](#Roadtools)
  * [Stormspotter](#Stormspotter)
  * [Azurehound](#Azurehound)
  * [Powerzure](#Powerzure-enumeration)
  * [MFAsweep](#MFASweep)

# General
- The three main tools used to enumerate
  - AzureAD Module. Syntax used is ```*AzureAD*```
    - **Used to manage Azure AD.**
    - Only to interact with Azure AD, no access to Azure resources. 
  - Azure Powershell. Syntax used is ```*Az*``` and ```*AzAd*```
    - **Used to manage Azure resources.**
  - Azure CLI. Syntax used is ```*az *``` (Az space)
    - **Create and manage Azure Resources.**
- AzureAD is for the Active Directory part of Azure. Users, Groups Etc.
- Azure PowerShell and Azure CLI Enumerate is for the Azure Cloud resources part.

#### Check MFA configuration of user
- https://github.com/dafthack/MFASweep
```
Import-Module MFASweep.ps1
Invoke-MFASweep -Username <EMAIL> -Password <PASSWORD>
```

## Entra-ID
## Azure portal
#### Login Azure portal
- Login to the azure portal with successfull attacks https://portal.azure.com/
- List of Azure Portals http://msportals.io/

#### Enumerate users, groups, devices, directory roles, enterprise applications
- Open the left menu --> Azure Active directory and click check the users, groups, Roles and administrators, Enterprise Application and devices tab.
- Also worth checking the "App services" and "Virtual machines" 

## Microsoft Graph
- Provides access to
	- Microsoft 365 core services (Office, OneDrive, Mail, Teams etc)
	- Enterprise Mobility + Security Services (Entra ID, Intune, Defender)
	- Windows Services (Activities, devices, notifications etc.)
	- Dynamics 365 (ERP)
- Endpoint: https://graph.microsoft.com
- [Documentation](https://learn.microsoft.com/en-us/graph/api/overview?view=graph-rest-1.0)

## MG module
- https://learn.microsoft.com/en-us/powershell/microsoftgraph/installation?view=graph-powershell-1.0
- Commands in MG are autogenerated from the Graph API and replaces Azure AD and MSOnline modules
- Check out [this blog](https://practical365.com/microsoft-graph-api-permission) and [this MS doc](https://learn.microsoft.com/en-us/powershell/microsoftgraph/find-mg-graph-permission?view=graph-powershell-1.0) to learn more about MG Module scope and permissions

#### Install MG module
```
Install-Module Microsoft.Graph
```

### Authentication
- Supports delegated access and app-only access
	- Delegated access (act on behalf of user), consent is required when using the module for the first time
	- App-only access, admin consent is required

#### Login with delegated access
- Required to specify `-Scopes` except when using access tokens as it has the scope in the token
- Use `-UseDeviceAuthentication` for device auth
- Use `-AccessToken` to use access token for auth

```
Connect-MgGraph -Scopes "User.Read.All"

$MSGraphAccessToken = ""
Connect-MgGraph -AccessToken ($MSGraphAccessToken | ConvertTo-SecureString -AsPlainText -Force)
```

#### Login with App-Only Cert
```
Connect-MgGraph -ClientId <APPID> -TenantId <TENANT ID> -CertificateThumbprint <CERT THUMBPRINT>
```

```
[X509Certificate]$AppCertificate = Get-PfxCertificate -FilePath <PATH TO CERT>

Connect-MgGraph -Certificate $AppCertificate -ClientId <APPID> -TenantId <TENANT ID> -CertificateThumbprint <CERT THUMBPRINT>
```

#### Login with App-Only client secret
```
$Password = ConvertTo-SecureString '<SECRET>' -AsPlainText -Force
$Creds = New-Object System.Management.Automation.PSCredential('<ID>', $Password)

Connect-MgGraph -TenantId <TENANTID> -ClientSecretCredential $Creds
```

#### Login with App-Only Managed Identity
```
Connect-MgGraph -Identity
```

#### Check current context
```
Get-MgContext
```

#### Check required permissions for command
```
Find-MgGraphCommand -command Get-MgUser | Select -First 1 -ExpandProperty Permissions
```

#### Check required permissions for actions or domain
- For example application or directory
```
Find-MgGraphPermission <DOMAIN>
Find-MgGraphPermission application
```

### Users
#### List all users
```
Get-MgUser -All
```

#### List specific user
```
Get-MgUser -UserId <USER UPN>
```

#### Find user with specific displayname
```
Get-MgUser -Search "Displayname:<NAME>" -ConsistencyLevel eventual -All

Get-MgUser -All | Where-Object -Property Displayname -Match "<NAME>"
```

#### List all users with the string admin
```
Get-MgUser -All | Where-Object -Property Displayname -Match "admin"
```

#### List all the attributes
```
Get-MgUser -UserId <USER UPN> | Format-List *
```

#### List all member users
```
Get-MgUser -All -Filter "UserType eq 'Member'"
```

#### List all guests
```
Get-MgUser -All -Filter "UserType eq 'Guest'"
```

#### List on-premises users synced to cloud
```
Get-MgUser -All -Filter "OnPremisesSyncEnabled eq true" -Property UserPrincipalName, OnPremisesSyncEnabled | Select-Object UserPrincipalName, OnPremisesSyncEnabled
```

#### List cloud only users
```
Get-MgUser -All -Property UserPrincipalName, OnPremisesSyncEnabled | Where-Object -Property OnPremisesSyncEnabled -NE "True" | Select-Object UserPrincipalName, OnPremisesSyncEnabled
```

#### List objects created by specific user
```
Get-MgUserCreatedObject -UserId <UPN USER>
```

#### Check created Object Id
```
Get-MgDirectoryObject -DirectoryObjectId <DirectoryScopeId> | fl

Get-MgDirectoryObject -DirectoryObjectId <DirectoryScopeId> | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}} | fl
```

#### List objects created by user loop
```
Get-MgUser -All | ForEach-Object {$Name = $_.UserPrincipalName; Write-Host "Checking created objects for $Name"; Get-MgUserCreatedObject -UserId $_.UserPrincipalName | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}; Write-Host " "}
```

#### Check group memberships of user
```
(Get-MgUser -UserId <USER UPN> -ExpandProperty MemberOf).MemberOf | ForEach-Object {Get-MgDirectoryObject -DirectoryObjectId $_.Id | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}}
```

```
Get-MgUserMemberOf -UserId <USER> | Select-Object @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}
```

### Groups
#### List all groups
```
Get-MgGroup -All
```

### List a specific group
```
Get-MgGroup -GroupId <ID>

Get-MgGroup -GroupId <ID> | fl *
```

#### Find groups with the name admin
```
Get-MgGroup -Search "Displayname:admin" -ConsistencyLevel eventual

Get-MgUser -All | Where-Object -Property Displayname -Match "admin"
```

#### List dynamic groups
```
Get-MgGroup -Filter "groupTypes/any(c:c eq 'DynamicMembership')" -All:$true | Select-Object Displayname, Id, MembershipRule
```

#### List 365 groups
```
Get-MgGroup -Filter "groupTypes/any(c:c eq 'Unified')" -All
```

#### List all public 365 groups
```
Get-MgGroup -Filter "groupTypes/any(c:c eq 'Unified')" -All | Where-Object -Property Visibility -eq "Public" | Select-Object DisplayName, Id, Visibility
```

#### List all security enabled groups
```
Get-MgGroup -Filter "SecurityEnabled eq true" -All
```

#### List all groups which can have a role assigned
```
Get-MgGroup -Filter "IsAssignableToRole eq true" -All
```

#### List on-premises groups synced to cloud 
```
Get-MgGroup -All -Filter "OnPremisesSyncEnabled eq true"
```

#### List cloud only groups
```
Get-MgGroup -All -Property DisplayName, Id, OnPremisesSyncEnabled | Where-Object -Property OnPremisesSyncEnabled -NE "True" | Select-Object DisplayName, Id, OnPremisesSyncEnabled
```

#### List members of a group
```
Get-MgGroupMember -GroupId <ID> | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}
```

### Roles
#### List all activated(assigned) roles
- Only show build in roles!

```
Get-MgDirectoryRole -All | Select-Object Id, Displayname, Description
```

#### List all custom roles
```
Get-MgRoleManagementDirectoryRoleDefinition -All -Filter 'IsBuiltIn eq false'
```

#### List members of specific role
```
Get-MgDirectoryRoleMember -DirectoryRoleId <OBJCET ID> | ForEach-Object {Get-MgDirectoryObject -DirectoryObjectId $_.Id | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}}
```

#### List role assignments
```
Get-MgRoleManagementDirectoryRoleAssignment
```

#### List role assignments for specific object
```
Get-MgRoleManagementDirectoryRoleAssignment -Filter "principalId eq '<OBJECT ID>'"
```

#### List definition of the role
```
Get-MgRoleManagementDirectoryRoleDefinition -UnifiedRoleDefinitionId <ROLE ID>
```

#### Check Entra role assignments for specific object loop
```
Get-MgRoleManagementDirectoryRoleAssignment -Filter "principalId eq '<OBJECT ID>'" | ForEach-Object {
	$roleDef = Get-MgRoleManagementDirectoryRoleDefinition -UnifiedRoleDefinitionId $_.RoleDefinitionId
	[PSCustomObject]@{
		RoleDisplayName = $roleDef.DisplayName
		RoleId = $roleDef.Id
		DirectoryScopeId = $_.DirectoryScopeId
	}
} | Select-Object RoleDisplayName, RoleId, DirectoryScopeId | fl
```

#### Check DirectoryScopeId
```
Get-MgDirectoryObject -DirectoryObjectId <DirectoryScopeId> | fl

Get-MgDirectoryObject -DirectoryObjectId <DirectoryScopeId> | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}} | fl
```

#### List eligible role assignments
- Requires `RoleManagement.Read.All`

```
$Spacing = "------------------------------------------------------------------------------------------"; Get-MgRoleManagementDirectoryRoleEligibilityScheduleInstance -ExpandProperty "*" -All | ForEach-Object {echo $Spacing; Get-MgDirectoryObjectById -Ids $_.PrincipalId |Select-Object -ExpandProperty AdditionalProperties; $roleDef = Get-MgRoleManagementDirectoryRoleDefinition -UnifiedRoleDefinitionId $_.RoleDefinitionId; [PSCustomObject]@{RoleDisplayName = $roleDef.DisplayName; RoleId = $roleDef.Id; MemberType = $_.MemberType; DirectoryScopeId = $_.DirectoryScopeId} | fl; echo $Spacing;}
```

### Devices
#### List devices
```
Get-MgDevice -All

Get-MgDevice -All | Select-Object Id, DisplayName, OperatingSystem, OperatingSystemVersion, TrustType | Format-Table
```

#### List all BYOD devices
- [Trusttype source](https://learn.microsoft.com/en-us/dotnet/api/microsoft.azure.powershell.cmdlets.resources.msgraph.models.apiv10.microsoftgraphdevice.trusttype?view=az-ps-latest#microsoft-azure-powershell-cmdlets-resources-msgraph-models-apiv10-microsoftgraphdevice-trusttype)

```
Get-MgDevice -All -Filter "TrustType eq 'Workplace'" | Select-Object Id, DisplayName, OperatingSystem, OperatingSystemVersion, IsCompliant | Format-Table
```

#### List Cloud only devices
```
Get-MgDevice -All -Filter "TrustType eq 'AzureAd'" | Select-Object Id, DisplayName, OperatingSystem, OperatingSystemVersion, IsCompliant | Format-Table
```

#### List Hybrid devices
```
Get-MgDevice -All -Filter "TrustType eq 'ServerAd'" | Select-Object Id, DisplayName, OperatingSystem, OperatingSystemVersion, IsCompliant | Format-Table
```

#### List owner of the device
```
Get-MgDeviceRegisteredOwner -DeviceId <DEVICE ID> | ForEach-Object {Get-MgDirectoryObject -DirectoryObjectId $_.Id | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}}
```

#### List registered user of the device
```
Get-MgDeviceRegisteredUser -DeviceId <DEVICE ID> | ForEach-Object {Get-MgDirectoryObject -DirectoryObjectId $_.Id | Select-Object Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectType';Expression={$_.AdditionalProperties.'@odata.type'}}}
```

### Administrative Unit
#### List administrative units
```
Get-MgDirectoryAdministrativeUnit -All
```

#### List administrative units members
```
Get-MgDirectoryAdministrativeUnitMember -AdministrativeUnitId <OBJCET ID> | Select-Object Id, @{Name='userPrincipalName';Expression={$_.AdditionalProperties.userPrincipalName}} | fl
```

### Applications
#### List App registrations
```
Get-MgApplication -All
```

#### List App registrations with certificate or secrets
- Can also be done by API which shows thumbprint [see here](#Check-if-application-has-passwords-or-certificates)

```
Get-MgApplication -All -Property AppId, Id, DisplayName, KeyCredentials, PasswordCredentials | Where-Object {$_.KeyCredentials -Or $_.PasswordCredentials} | Select-Object Appid, Id, DisplayName, KeyCredentials, PasswordCredentials
```

#### List app registration certificate thumbprints
```
Get-MgApplication -All -Property AppId, Id, DisplayName, KeyCredentials | Where-Object -Property KeyCredentials | Select-Object Appid, Id, Displayname, @{Name='Thumbprint';Expression={[System.Convert]::ToBase64String($_.KeyCredentials.CustomKeyIdentifier)}}
```

#### Check if thumbprint matches
```
$clientCertificate = New-Object System.Security.Cryptography.X509Certificates.X509Certificate2 -ArgumentList
'C:\Users\Public\Cert.pfx'

Get-MgApplication -All -Property AppId, Id, DisplayName, KeyCredentials | Where-Object -Property KeyCredentials | Select-Object Appid, Id, Displayname, @{Name='Thumbprint';Expression={[System.Convert]::ToBase64String($_.KeyCredentials.CustomKeyIdentifier)}} | Where-Object -Property Thumbprint -eq $clientCertificate.Thumbprint
```

#### List all Enterprise applications
- Many from Microsoft

```
Get-MgServicePrincipal -All
```

#### List service principal by name
```
Get-MgServicePrincipal -Filter "DisplayName eq '<NAME>'"
```

#### List service principal of app registration
- `Id` is the Object ID of the app registration from `Get-MgApplication`

```
Get-MgApplication -All

Get-MgServicePrincipal -Filter "Appid eq '<ID>'"
```

#### List Enterprise Applications non Microsoft
```
Get-MgServicePrincipal -Filter "tags/Any(x: x eq 'WindowsAzureActiveDirectoryIntegratedApp')"
```

#### List Enterprise Applications managed identity
```
Get-MgServicePrincipal -Filter "servicePrincipalType eq 'ManagedIdentity'"
```

#### Check role assignments
- Check the ResourceDisplayName (Example Microsoft Graph)

```
$ObjectId = ""

$AppRoleAssignment = Get-MgServicePrincipalAppRoleAssignment -ServicePrincipalId $ObjectId 

$AppRoleAssignment | fl
```

- Resolve AppRoleID permission
	- Check well known app ids [here](https://learn.microsoft.com/en-us/troubleshoot/azure/entra/entra-id/governance/verify-first-party-apps-sign-in#application-ids-of-commonly-used-microsoft-applications)
	- Example uses well known appId of microsoft graph

```
(Get-MgServicePrincipal -Filter "appId eq '00000003-0000-0000-c000-000000000000'").AppRoles | ? {$_.id -eq <AppRoleId> } | fl
```

#### Check Entra role assignments
```
Get-MgRoleManagementDirectoryRoleAssignment -Filter "principalId eq '<OBJECT ID>'" | ForEach-Object {
	$roleDef = Get-MgRoleManagementDirectoryRoleDefinition -UnifiedRoleDefinitionId $_.RoleDefinitionId
	[PSCustomObject]@{
		RoleDisplayName = $roleDef.DisplayName
		RoleId = $roleDef.Id
		DirectoryScopeId = $_.DirectoryScopeId
	}
} | Select-Object RoleDisplayName, RoleId, DirectoryScopeId | fl
```

#### List owned objects
```
Get-MgServicePrincipalOwnedObject -ServicePrincipalId <ID> | select Id, @{Name='displayName';Expression={$_.AdditionalProperties.displayName}},@{Name='ObjectTyoe';Expression={$_.AdditionalProperties.'@odata.type'}} | fl
```

## Microsoft Graph API
#### Check if application has passwords or certificate
- Saved in `$ApplicationsDetails.Applications`
```
$GraphAccessToken = ""

$URI = "https://graph.microsoft.com/v1.0/Applications"
$RequestParams = @{
	Method = 'GET'
	Uri = $URI
	Headers = @{
		'Authorization' = "Bearer $GraphAccessToken"
	}
}

$Applications = (Invoke-RestMethod @RequestParams).value
$ApplicationsDetails = [PSCustomObject]@{
	Applications = @()}
foreach($Application in $Applications)
	{
		$applicationObject = [PSCustomObject]@{
		DisplayName = $Application.displayName
		AppId = $Application.appId
		CreatedDateTime = $Application.createdDateTime
		ID = $Application.id
		keyCredentials = $Application.keyCredentials
		passwordCredentials = $Application.passwordCredentials
	}
	$ApplicationsDetails.Applications += $applicationObject
}
$ApplicationsDetails.Applications
```

- If an application has the `keyCredentials` attribute it has certificates 
```
$ApplicationsDetails.Applications | Where-Object -Property keyCredentials
```

- If an application has the `passwordCredential` attribute it has client secrets
```
$ApplicationsDetails.Applications | Where-Object -Property passwordCredentials
```

- Check if thumbprint of cert matches
```
$clientCertificate = New-Object System.Security.Cryptography.X509Certificates.X509Certificate2 -ArgumentList
'C:\Users\Public\Cert.pfx'

$ApplicationsDetails.Applications | Where {$_.keyCredentials.customKeyIdentifier -eq $clientCertificate.Thumbprint}
```

## AzureAD Module
- https://www.powershellgallery.com/packages/AzureAD
- Rename .nukpkg to .zip and extract it
```
Import-Module AzureAD.psd1
```

#### Connect to Azure AD
```
$creds = Get-Credential
Connect-AzureAD -Credential $creds
```

```
$passwd = ConvertTo-SecureString "<PASSWORD>" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("<USERNAME>", $passwd)
Connect-AzureAD -Credential $creds
```

#### Connect with access tokens
```
Connect-AzureAD -AccountId <ID> -AadAccessToken $token -TenantId <TENANT ID>
```

#### Get the current session state
```
Get-AzureADCurrentSessionInfo
```

#### Get the details of the current tenant
```
Get-AzureADTenantDetail
```

### User enumeration
#### Enumerate all users
```
Get-AzureADUser -All $true
Get-AzureADUser -all $true | Select-Object UserPrincipalName, Usertype
```

#### Enumerate a specific user
```
Get-AzureADUser -ObjectId <ID>
```

#### Search for a user based on string in first characters of displayname (Wildcard not supported)
```
Get-AzureADUser -SearchString "admin"
```

#### Search for user who contain the word "admin" in their displayname
```
Get-AzureADUser -All $true |?{$_.Displayname -match "admin"}
```

#### List all the attributes for a user
```
Get-AzureADUser -ObjectId <ID> | fl * 

Get-AzureADUser -ObjectId <ID> | %{$_.PSObject.Properties.Name} 
```

#### Search attributes for all users that contain the string "password" 
```
Get-AzureADUser -All $true |%{$Properties = $_;$Properties.PSObject.Properties.Name | % {if ($Properties.$_ -match 'password') {"$($Properties.UserPrincipalName) - $_ - $($Properties.$_)"}}}
```

#### All users who are synced from on-prem
```
Get-AzureADUser -All $true | ?{$_.OnPremisesSecurityIdentifier -ne $null} 
```

#### All users who are from Azure AD
```
Get-AzureADUser -All $true | ?{$_.OnPremisesSecurityIdentifier -eq $null}
```

#### Get objects created by any user (use -objectid for a specific user)
```
Get-AzureADUser | Get-AzureADUserCreatedObject
```

#### Objects owned by a specific user
```
Get-AzureADUserOwnedObject -ObjectId <ID>
```

#### List MFA status of user
- https://github.com/0xJs/AzurePowerCommands
```
Get-AzureADUser | Get-AzureADUserMFAConfiguration
```

### Group enumeration
#### List all groups
```
Get-AzureADGroup -All $true
```

#### Enumerate a specific group
```
Get-AzureADGroup -ObjectId <ID>
```

#### Search for a group based on string in first characters of DisplayName (wildcard not supported)
```
Get-AzureADGroup -SearchString "admin" | fl * 
```

#### To search for a group which contains the word "admin" in their name
```
Get-AzureADGroup -All $true |?{$_.Displayname -match "admin"}
```

#### Get groups that allow Dynamic membership (note the cmdlet name)
```
Import-module AzureADPreview.psd1
Get-AzureADMSGroup | ?{$_.GroupTypes -eq 'DynamicMembership'}  | fl *
```

#### All groups that are synced from on-prem (note that security groups are not synced)
```
Get-AzureADGroup -All $true | ?{$_.OnPremisesSecurityIdentifier -ne $null}
```

#### All groups that are from Azure AD
```
Get-AzureADGroup -All $true | ?{$_.OnPremisesSecurityIdentifier -eq $null}
```

#### Get members of a group
```
Get-AzureADGroupMember -ObjectId <ID>
```

#### Get groups and roles where the specified user is a member
```
Get-AzureADUser -SearchString 'test' | Get-AzureADUserMembership
Get-AzureADUserMembership -ObjectId <UPN>
```

#### Recursivly search through group
- https://github.com/0xJs/AzurePowerCommands
```
Get-AzureADGroup -ObjectId <ID> | Get-AzureADGroupMemberRecursive
```

#### Usefull group + member script
```
$roleUsers = @() 
$roles=Get-AzureADMSGroup
 
ForEach($role in $roles) {
  $users=Get-AzureADGroupMember -ObjectId $role.Id
  ForEach($user in $users) {
    write-host $role.DisplayName, $user.DisplayName, $user.UserPrincipalName, $user.UserType
    $obj = New-Object PSCustomObject
    $obj | Add-Member -type NoteProperty -name GroupName -value ""
    $obj | Add-Member -type NoteProperty -name UserDisplayName -value ""
    $obj | Add-Member -type NoteProperty -name UserEmailID -value ""
    $obj | Add-Member -type NoteProperty -name UserAccess -value ""
    $obj.GroupName=$role.DisplayName
    $obj.UserDisplayName=$user.DisplayName
    $obj.UserEmailID=$user.UserPrincipalName
    $obj.UserAccess=$user.UserType
    $roleUsers+=$obj
  }
}
$roleUsers
```

### Role enumeration
#### Get all available role templates
```
Get-AzureADDirectoryroleTemplate
```

#### Get all roles
```
Get-AzureADDirectoryRole
```

#### Enumerate users to whom roles are assigned (Example of the Global Administrator role)
```
Get-AzureADDirectoryRole -Filter "DisplayName eq 'Global Administrator'" | Get-AzureADDirectoryRoleMember
```

#### List custom roles
```
Import-Module .\AzureADPreview.psd1
$creds = Get-Credential
Connect-AzureAD -Credential $creds

Get-AzureADMSRoleDefinition | ?{$_.IsBuiltin -eq $False} | select DisplayName
```

#### List members of role
```
Get-AzureADDirectoryRoleMember -ObjectId <ID>
```

#### Recursivly list members of role
- https://github.com/0xJs/AzurePowerCommands
```
Get-AzureADDirectoryRole -ObjectId <ID> | Get-AzureADDirectoryRoleMemberRecursive
```

### Devices enumeration
#### Get all Azure joined and registered devices
```
Get-AzureADDevice -All $true | fl *
```

#### Get the device configuration object (Note to the registrationquota in the output)
```
Get-AzureADDeviceConfiguration | fl *
```

#### List Registered owners of all the devices
```
Get-AzureADDevice -All $true | Get-AzureADDeviceRegisteredOwner
```

#### List Registered user of all the devices
```
Get-AzureADDevice -All $true | Get-AzureADDeviceRegisteredUser
```

#### List devices owned by a user
```
Get-AzureADUserOwnedDevice -ObjectId <ID>
```

#### List deviced registered by a user
```
Get-AzureADUserRegisteredDevice -ObjectId <ID>
```

#### List deviced managed using Intune
```
Get-AzureADDevice -All $true | ?{$_.IsCompliant -eq "True"} 
```

### Administrative-unit enumeration
#### List the administrative units
```
Get-AzureADMSAdministrativeUnit
```

#### Get members of the administrative unit
```
Get-AzureADMSAdministrativeUnitMember -id <ID>
```

#### Get roles scoped in the administrative unit
```
Get-AzureADMSScopedRoleMembership -id <ID> | fl *
```

#### Check the role using the roleid
```
Get-AzureADDirectoryRole -ObjectId <ID>
```

### App enumeration
#### Get all application objects registered using the current tenant.
```
Get-AzureADApplication -All $true
```

#### Get all details about an application
```
Get-AzureADApplication -ObjectId <ID> | fl *
```

#### Get an application based on the display name
```
Get-AzureADApplication -All $true | ?{$_.DisplayName -match "app"}
```

#### Show application with a application password (Will not show passwords)
```
Get-AzureADApplicationPasswordCredential 
```

#### Get the owner of a application
```
Get-AzureADApplication -ObjectId <ID> | Get-AzureADApplicationOwner | fl *
```

#### Get apps where a user has a role (exact role is not shown)
```
Get-AzureADUser -ObjectId <ID> | Get-AzureADUserAppRoleAssignment | fl * 
```

#### Get apps where a group has a role (exact role is not shown)
```
Get-AzureADGroup -ObjectId <ID> | Get-AzureADGroupAppRoleAssignment | fl *
```

### Service-principals enumeration
Enumerate Service Principals (visible as Enterprise Applications in Azure Portal). Service principal is local representation for an app in a specific tenant and it is the security object that has privileges. This is the 'service account'! Service Principals can be assigned Azure roles.

#### Get all service principals
```
Get-AzureADServicePrincipal -All $true
```

#### Get all details about a service principal
```
Get-AzureADServicePrincipal -ObjectId <ID> | fl *
```

#### Get a service principal based on the display name
```
Get-AzureADServicePrincipal -All $true | ?{$_.DisplayName -match "app"}
```

#### Get owners of a service principal
```
Get-AzureADServicePrincipal -ObjectId <ID> | Get-AzureADServicePrincipalOwner | fl *
```

#### Get objects owned by a service principal
```
Get-AzureADServicePrincipal -ObjectId <ID> | Get-AzureADServicePrincipalOwnedObject
```

#### Get objects created by a service principal
```
Get-AzureADServicePrincipal -ObjectId <ID> | Get-AzureADServicePrincipalCreatedObject
```

#### Get group and role memberships of a service principal
```
Get-AzureADServicePrincipal -ObjectId <ID> | Get-AzureADServicePrincipalMembership | fl * 

Get-AzureADServicePrincipal | Get-AzureADServicePrincipalMembership
```

## Azure resources
## Enumeration using AZ powershell
#### Install module
```
Install-Module Az
```

#### List all az commands
```
Get-Command -Module Az.*
```

#### List cmdlets for Az AD powershell (\*Azad format\*)
```
Get-Command *aZad*
```

#### List all cmdlets for Azure resources (\*Az format\*)
```
Get-Command *aZ*
```

#### List all cmdlets for a particular resource
```
Get-Command *azvm*
Get-Command -Noun *vm* -Verb Get
Get-Command *vm*
```

#### Login with account
```
Connect-AzAccount
```

#### Authenticate with Service Principal / Managed Identity
- Uses cleartext credentials.
```
$password = ConvertTo-SecureString '<SECRET>' -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential('<ACCOUNT ID>', $password)
Connect-AzAccount -ServicePrincipal -Credential $creds -Tenant <TENANT ID>
```

- Using certificate
```
Connect-AzAccount -ServicePrincipal -ApplicationId <APP ID> -Tenant <TENANT ID> -CertificatePath <PATH TO CERT>
```

#### Login with access tokens
```
Connect-AzAccount -AccessToken $AMRAccessToken -AccountId <USER UPN>
```

#### Get the information about the current context (Account, Tenant, Subscription etc).
```
Get-AzContext
```

#### List available contexts
```
Get-AzContext -ListAvailable
```

### Available resources
#### Enumerate subscriptions accessible by the current user
```
Get-AzSubscription
```

#### Enumerate all resources visible to the current user
- Error 'this.Client.SubscriptionId' cannot be null' means the managed identity has no rights on any of the Azure resources.
```
Get-AzResource
Get-AzResource | select-object Name, Resourcetype
```

### Roles
#### Enumerate all Azure RBAC role assignments
```
Get-AzRoleAssignment
```

#### Check role assignments on ResourceID
```
Get-AzRoleAssignment -Scope <RESOURCE ID>
```

#### Get the allowed actions on the role definition
```
Get-AzRoleDefinition -Name "<ROLE DEFINITION NAME>"
```

### Users
#### Enumerate all users
```
Get-AzADUser
```

#### Enumerate a specific user
```
Get-AzADUser -UserPrincipalName <NAME>
```

#### Search for a user based on string in first character of displayname (Wildcard not supported)
```
Get-AzADUser -SearchString "admin" 
```

#### Search for a user who contain the word "admin" in their displayname:
```
Get-AzADUser |?{$_.Displayname -match "admin"}
```

### Groups
#### List all groups
```
Get-AzADGroup
```

#### Enumerate a specific group
```
Get-AzADGroup -ObjectId <ID>
```

#### Search for a group based on string in first characters of displayname (wildcard not supported)
```
Get-AzADGroup -SearchString "admin" | fl * 
```

#### To search for groups which contain the word "admin" in their name:
```
Get-AzADGroup |?{$_.Displayname -match "admin"}
```

#### Get members of a group
```
Get-AzADGroupMember -ObjectId <ID>
```

### Resources
####  Get all the application objects registered with the current tenant (visible in App  Registrations in Azure portal). An application object is the global representation of an app. 
```
Get-AzADApplication
Get-AzWebApp
```

#### Get all details about an application
```
Get-AzADApplication -ObjectId <ID>
```

#### Get an application based on the display name
```
Get-AzADApplication | ?{$_.DisplayName -match "app"}
```

#### Get all service principals
```
Get-AzADServicePrincipal
```

#### Get all details about a service principal
```
Get-AzADServicePrincipal -ObjectId <ID>
```

#### Get an service principal based on the display name
```
Get-AzADServicePrincipal | ?{$_.DisplayName -match "app"} 
```

#### List all VM's the user has access to
```
Get-AzVM 
Get-AzVM | fl
```

#### Get OS Details
- List local admin username
```
$vm = Get-AzVM -Name <name> 
$vm.OSProfile
```

#### List vm's which are a managed identity
```
(az vm list | ConvertFrom-Json) | ForEach-Object {$_.name;(az vm identity show --resource-group $_.resourceGroup --name $_.name | ConvertFrom-Json)}
```

#### Get all function apps
```
Get-AzFunctionApp
```

#### Get all webapps
```
Get-AzWebApp
Get-AzWebApp | select-object Name, Type, Hostnames
```

#### List all storage accounts
```
Get-AzStorageAccount
Get-AzStorageAccount | fl
```

#### List all keyvaults
```
Get-AzKeyVault
```

#### Get info about a specific keyvault
```
Get-AzKeyVault -VaultName ResearchKeyVault
```

#### List the saved creds from keyvault
```
Get-AzKeyVaultSecret -VaultName ResearchKeyVault -AsPlainText
```

#### Read creds from a keyvault
```
Get-AzKeyVaultSecret -VaultName ResearchKeyVault -Name Reader -AsPlainText
```

### Networking
#### List virtual networks
```
Get-AzVirtualNetwork
```

#### List public IP addresses assigned to virtual NICs
```
Get-AzPublicIpAddress
```

#### Get Azure ExpressRoute (VPN) Info
```
Get-AzExpressRouteCircuit
```

#### Get Azure VPN Info
```
Get-AzVpnConnection
```

### SQL server
#### List SQL servers
```
Get-AzSQLServer
```

#### List databases
```
Get-AzSqlDatabase -ServerName <Server Name> -ResourceGroupName <Resource Group Name>
```

#### List SQL Firewall rules
```
Get-AzSqlServerFirewallRule –ServerName <ServerName> -ResourceGroupName <ResourceGroupName>
```
  
#### List out SQL server AD Admins
```
Get-AzSqlServerActiveDirectoryAdminstrator -ServerName <ServerName> -ResourceGroupName <ResourceGroupName>
```

### Runbooks
#### List Azure Runbooks
```
Get-AzAutomationAccount
Get-AzAutomationRunbook -AutomationAccountName <AutomationAccountName> -ResourceGroupName <ResourceGroupName>
```

#### Export a runbook
```
Export-AzAutomationRunbook -AutomationAccountName <account name> -ResourceGroupName <resource group name> -Name <runbook name> -OutputFolder .\Desktop\
```

## Enumeration using Azure CLI
- Install https://docs.microsoft.com/en-us/cli/azure/install-azure-cli
- Accessible in the cloud shell to

#### Login
```
az login

az login -u <USERNAME> -p <PASSWORD>
```

#### List resources
```
az resource list
```

#### List info on the current user
```
az ad signed-in-user show
```

#### Configure default behavior (Output type, location, resource group etc)
```
az configure
```

#### Find popular commands
```
az find "vm"

az find "az vm"

az find "az vm list" 
```

#### List all users
Use the --output parameter to change the output layout, default is json
```
az ad user list --output table
```

#### List only the userPrincipalName and givenName
Second command renames properties
```
az ad user list --query "[].[userPrincipalName,displayName]" --output table

az ad user list --query "[].{UPN:userPrincipalName, Name:displayName}" --output table
```

#### We can use JMESPath query on the results of JSON output. Add --query-examples at the end of any command to see examples
```
az ad user show list --query-examples 
```

#### Get details of the current tenant
```
az account tenant list
```

#### Get details of the current subscription
```
az account subscription list
```

#### List the current signed-in user
```
az ad signed-in-user show
```

#### List all owned objects by user
```
az ad signed-in-user list-owned-objects
```

#### Enumerate all users
```
az ad user list
az ad user list --query "[].[displayName]" -o table
```

#### Enumerate a specific user
```
az ad user show --id <UPN>
```

#### Search for users who contain the word "admin" in their Display name (case sensitive):
```
az ad user list --query "[?contains(displayName,'admin')].displayName"
```

#### When using PowerShell, search for users who contain the word "admin" in their Display name. This is NOT case-sensitive:
```
az ad user list | ConvertFrom-Json | %{$_.displayName -match "admin"}
```

#### List all users who are synced from on-prem
```
az ad user list --query "[?onPremisesSecurityIdentifier!=null].displayName"
```

#### All users who are from Azure AD
```
az ad user list --query "[?onPremisesSecurityIdentifier==null].displayName"
```

#### List all groups
```
az ad group list 
az ad group list --query "[].[displayName]" -o table
```

#### Enumerate a specific group using display name or object id
```
az ad group show -g "VM Admins" 
az ad group show -g <ID>
```

#### Search for groups that contain the word "admin" in their Display name (case sensitive) - run from cmd:
```
az ad group list --query "[?contains(displayName,'admin')].displayName"
```

#### When using PowerShell, search for groups that contain the word "admin" in their Display name. This is NOT case-sensitive:
```
az ad group list | ConvertFrom-Json | %{$_.displayName -match "admin"}
```

#### All groups that are synced from on-prem
```
az ad group list --query "[?onPremisesSecurityIdentifier!=null].displayName"
```

#### All groups that are from Azure AD
```
az ad group list --query "[?onPremisesSecurityIdentifier==null].displayName"
```

#### Get members of a group
```
az ad group member list -g "VM Admins" --query "[].[displayName]" -o table 
```

#### Check if user is member of the specified group
```
az ad group member check --group "VM Admins" --member-id <ID>
```

#### Get the object IDs of the groups of which the specified group is a member
```
az ad group get-member-groups -g "VM Admins"
```

#### Get all the application objects registered with the current tenant
```
az ad app list
az ad app list --query "[].[displayName]" -o table
```

#### Get all details about an application using identifier uri, application id or object id
```
az ad app show --id <ID>
```

#### Get an application based on the display name (Run from cmd)
```
az ad app list --query "[?contains(displayName,'app')].displayName"
```

#### When using PowerShell, search for apps that contain the word "slack" in their Display name. This is NOT case-sensitive:
```
az ad app list | ConvertFrom-Json | %{$_.displayName -match "app"}
```

#### Get owner of an application
```
az ad app owner list --id <ID> --query "[].[displayName]" -o table
```

#### List apps that have password credentials
```
az ad app list --query "[?passwordCredentials != null].displayName" 
```

#### List apps that have key credentials
```
az ad app list --query "[?keyCredentials != null].displayName" 
```

#### Get all service principal names
```
az ad sp list --all
az ad sp list -all --query "[].[displayName]" -o table
```

#### Get all details about a service principal
```
az ad sp show --id <ID>
```

#### Get a service principal based on the display name
```
az ad sp list --all --query "[?contains(displayName,'app')].displayName"
```

#### When using PowerShell, search for service principals that contain the word "slack" in their Display name. This is NOT case-sensitive:
```
az ad sp list --all | ConvertFrom-Json | %{$_.displayName -match "app"}
```

#### Get owner of a service principal
```
az ad sp owner list --id <ID> --query "[].[displayName]" -o table
```

#### Get service principal owned by the current user
```
az ad sp list --show-mine
```

#### List apps that have password credentials
```
az ad sp list --all --query "[?passwordCredentials != null].displayName"
```

#### List apps that have key credentials
```
az ad sp list -all --query "[?keyCredentials != null].displayName"
```

#### List all the vm's
```
az vm list
az vm list --query "[].[name]" -o table
```

#### List all app services
```
az webapp list
az webapp list --query "[].[name]" -o table
```

#### List function apps
```
az functionapp list
az functionapp list --query "[].[name]" -o table
```

#### list the readable keyvaults
```
az keyvault list
```

#### List storage accounts
```
az storage account list
```

## ARM API
#### Check permissions on resource
- https://learn.microsoft.com/en-us/rest/api/authorization/permissions?view=rest-authorization-2022-04-01

```
GET https://management.azure.com/subscriptions/{subscriptionId}/resourcegroups/{resourceGroupName}/providers/{resourceProviderNamespace}/{parentResourcePath}/{resourceType}/{resourceName}/providers/Microsoft.Authorization/permissions?api-version=2022-04-01
```

```
https://management.azure.com/<RESOURCE ID PART OF Get-AzResource>/providers/Microsoft.Authorization/permissions?api-version=2022-04-01
```

- General example:
```
Get-AzResource
```

```
$Name = "<RESOURCE NAME>"
$ARMAccessToken = "<TOKEN>"

$Resource = Get-AzResource -Name $Name
$SubscriptionID = (Get-AzSubscription).Id
$ResourceGroupName = $Resource.ResourceGroupName
$ResourceName = $Resource.Name
$ResourceProviderNamespace = $Resource.ResourceType

$URI = "https://management.azure.com/subscriptions/$SubscriptionID/resourcegroups/$ResourceGroupName/providers/$ResourceProviderNamespace/$ResourceName/providers/Microsoft.Authorization/permissions?api-version=2022-04-01"
$RequestParams = @{
	Method = 'GET'
	Uri = $URI
	Headers = @{
		'Authorization' = "Bearer $ARMAccessToken"
	}
}
$Permissions = (Invoke-RestMethod @RequestParams).value

$Permissions | fl *
```

- Loop through all resources using Object ID
```
$ARMAccessToken = "<TOKEN>"

$Resources = Get-AzResource

foreach($Resource in $Resources)
{
	$ID = $Resource.Id
	$URI = "https://management.azure.com/$ID/providers/Microsoft.Authorization/permissions?api-version=2022-04-01"
	$RequestParams = @{
		Method = 'GET'
		Uri = $URI
		Headers = @{
			'Authorization' = "Bearer $ARMAccessToken"
		}
		ContentType = "application/json"
}

$Result = Invoke-RestMethod @RequestParams
$ResourceName = $Resource.Name

Write-Output "ResourceName - $ResourceName"
Write-Output "Permissions -" $Result.value | fl *
}
```

## Tools
### Roadtools
https://github.com/dirkjanm/ROADtools
- Enumeration using RoadRecon includes three steps
  – Authentication
  – Data Gathering
  – Data Exploration
  
####  roadrecon supports username/password, access and refresh tokens, device code flow (sign-in from another device) and PRT cookie.
```
cd C:\AzAD\Tools\ROADTools
pipenv shell 
roadrecon auth -u <USERNAME> -p <PASSWORD>
```

#### Gather information
```
roadrecon gather
```

#### Start roadrecon gui
```
roadrecon gui
```

### Stormspotter
https://github.com/Azure/Stormspotter

#### Start the backend service
```
cd C:\AzAD\Tools\stormspotter\backend\
pipenv shell
python ssbackend.pyz
```

#### Start the frontend server
```
cd C:\AzAD\Tools\stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history
```

#### Collect data
```
cd C:\AzAD\Tools\stormspotter\stormcollector\
pipenv shell
az login -u <USERNAME> -p <PASSWORD>
python C:\AzAD\Tools\stormspotter\stormcollector\sscollector.pyz cli 
```

#### Check data
- Log-on to the webserver at http://localhost:9091. creds = neo4j:BloodHound
- After login, upload the ZIP archive created by the collector.
- Use the built-in queries to visualize the data.

### Azurehound
- More queries: https://hausec.com/2020/11/23/azurehound-cypher-cheatsheet/
- https://github.com/BloodHoundAD/AzureHound
- https://bloodhound.readthedocs.io/en/latest/data-collection/azurehound.html

### Without MFA/CA
```
.\azurehound.exe -u <USER> -p <PASSWORD> list --tenant "<TENANT ID>" -o output.json
```

#### Device code login
```
$body = @{
    "client_id" =     "1950a258-227b-4e31-a9cf-717495945fc2"
    "resource" =      "https://graph.microsoft.com"
}
$UserAgent = "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36"
$Headers=@{}
$Headers["User-Agent"] = $UserAgent
$authResponse = Invoke-RestMethod `
    -UseBasicParsing `
    -Method Post `
    -Uri "https://login.microsoftonline.com/common/oauth2/devicecode?api-version=1.0" `
    -Headers $Headers `
    -Body $body
$authResponse
```

#### Retrieve access token
```
$body=@{
    "client_id" =  "1950a258-227b-4e31-a9cf-717495945fc2"
    "grant_type" = "urn:ietf:params:oauth:grant-type:device_code"
    "code" =       $authResponse.device_code
}
$Tokens = Invoke-RestMethod `
    -UseBasicParsing `
    -Method Post `
    -Uri "https://login.microsoftonline.com/Common/oauth2/token?api-version=1.0" `
    -Headers $Headers `
    -Body $body
$Tokens
```

#### Run the collector
- Use `-v 2` to increase the verbosity
```
$Token = <ACCESS TOKEN>

.\azurehound.exe -r $Token list --tenant "tenant ID" -o output.json
```

#### Change object ID's to names in Bloodhound
```
MATCH (n) WHERE n.azname IS NOT NULL AND n.azname <> "" AND n.name IS NULL SET n.name = n.azname
```

#### Find all users who have the Global Administrator role
```
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
```

#### Find all paths to an Azure VM
```
MATCH p = (n)-[r]->(g: AZVM) RETURN p
```

#### Find all paths to an Azure KeyVault
```
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
```

#### Find all paths to an Azure Resource Group
```
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
```

#### Find Owners of Azure Groups
```
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
```

## Powerzure enumeration
- https://github.com/hausec/PowerZure
- https://powerzure.readthedocs.io/en/latest/

#### Whoami
```
Show-AzureCurrentUser
```

### List all users
```
Get-AzureUser -All
```

#### List all groups
```
Get-AzureGroup -All
```

#### List all users of a group
```
Get-AzureGroup –Group ‘Global Admins’
```

#### List resources
```
Get-AzureTargets
```

#### List out owners of applications
```
Get-AzureAppOwners
```

#### Lists members of a role
```
Get-AzureADRole -Role <ROLE NAME>
```

#### Lists key vaults
```
Show-AzureKeyVaultContent
```

#### List storage accounts
```
Show-AzureStorageContent
```

#### Lists runbook contents
```
Get-AzureRunbookContent
```

#### Create link to download a VM disk
```
Get-AzureVMDisk 
```
